Tekla Open API Reference for Tekla Structures 2025
LinkBase.GetObjectAlignedBoundingBox Method
 Gets the bounding box for the current object in its local coordinate system.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RectangleBoundingBox GetObjectAlignedBoundingBox()
Public Function GetObjectAlignedBoundingBox As RectangleBoundingBox
Return Value
Type: RectangleBoundingBox
A rectangle bounding box for the current object.
Implements
IObjectAlignedBoundingBox.GetObjectAlignedBoundingBox()
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace